{"company_name": "Euphoric Thought Technologies", "job_title": "Sr. Dot Net Developer", "job_location": "Bengaluru, Karnataka", "apply_link": "https://in.indeed.com/viewjob?jk=60b52abd990736c2", "job_description": "Company Description\nEuphoric Thought Technologies Pvt. Ltd. is committed to technology modernization and development, with a relentless focus on performance and result-driven solutions for organizations. Driven by innovation, we approach challenges differently and emphasize thoughtful action and enthusiasm. Our services encompass Product Development, Cloud Management and Consulting, DevOps, ML/AI, ServiceNow Integration, Blockchain Development, and Data Analytics.\nRole Description\nThis is a full-time, on-site role for a Sr. Dot Net Developer located in Bengaluru. The Sr. Dot Net Developer will be responsible for designing, coding, testing, and implementing software applications. Day-to-day tasks include developing software using .NET Core and ASP.NET MVC, engaging in Object-Oriented Programming (OOP), and collaborating with cross-functional teams to ensure high-quality deliverables.\nQualifications\nProficiency in .NET Core and ASP.NET MVC\nStrong skills in Object-Oriented Programming (OOP) and Software Development methodologies\nExperience in programming and coding\nExcellent analytical and problem-solving abilities\nAbility to work effectively in a team-oriented environment\nBachelor's degree in Computer Science, Engineering, or a related field\nRelevant certifications and experience in the technology industry are a plus\nJob Types: Full-time, Permanent\nPay: ₹800,000.00 - ₹1,400,000.00 per year\nBenefits:\nHealth insurance\nProvident Fund\nWork from home\nSchedule:\nDay shift\nMonday to Friday\nMorning shift\nWork Location: In person", "source": "Indeed"}
{"company_name": "Autosprint", "job_title": "1. Junior AI Engineer", "job_location": "Chanda Nagar, Hyderabad, Telangana", "apply_link": "https://in.indeed.com/viewjob?jk=9ac686a4ea9cfd85", "job_description": "We are hiring a Junior AI Engineer to assist in developing and deploying AI-driven\nsolutions. The ideal candidate should have a strong foundation in AI/ML techniques\nand be eager to work on real-world projects.\nResponsibilities:\n Develop and implement AI models for various applications.\n Support data collection, cleaning, and preprocessing activities.\n Conduct experiments to improve existing AI algorithms.\n Work with cross-functional teams to integrate AI solutions into products.\n Stay updated on the latest AI trends and advancements.\nRequirements:\n Bachelor's degree in Computer Science, AI, Data Science, or a related field.\n Proficiency in Python and familiarity with AI libraries (TensorFlow, PyTorch,\nOpenCV).\n Basic understanding of neural networks, NLP, or computer vision.\n Ability to write clean, efficient, and well-documented code.\n Strong problem-solving and critical-thinking skills.\nJob Types: Full-time, Fresher\nPay: ₹600,000.00 - ₹800,000.00 per year\nWork Location: In person", "source": "Indeed"}
{"company_name": "Innovative Cursor", "job_title": "Go Developer", "job_location": "Remote", "apply_link": "https://in.indeed.com/viewjob?jk=7068065ad589954a", "job_description": "About Us:\nInnovative Cursor, started in 2023, is a SaaS company crafting custom tech solutions for businesses and consumers. We build websites, mobile apps, games, AR/VR experiences, IoT systems, and enterprise software to boost growth and engagement. Our goal is to lead with innovation, delivering smart, user-friendly platforms that transform ideas into reality.\nJob Summary:\nWe are seeking two skilled Go Developers with expertise in the Gin framework to design, develop, and maintain high-performance backend systems and APIs. This role will be pivotal in building scalable, efficient server-side applications, integrating with cloud services like AWS S3, and contributing to our diverse portfolio of projects, including web applications and enterprise solutions.\nResponsibilities:\nDesign, develop, and maintain server-side applications using Go and the Gin framework.\nBuild and optimize RESTful APIs to support seamless website functionality and third-party integrations.\nImplement robust HTTP-based solutions with a strong understanding of HTTP fundamentals.\nWork with AWS S3 for efficient storage, retrieval, and management of data.\nCollaborate with cross-functional teams to troubleshoot, debug, and enhance application performance.\nContribute to the development and customization of enterprise solutions as needed.\nParticipate in code reviews to ensure code quality and adhere to project timelines for timely delivery.\nQualifications Required:\nBachelor’s degree in Computer Science, IT, or a related field (or equivalent experience).\nMinimum 2 years of experience in backend development using Go, including internships.\nProven proficiency in the Gin framework for building scalable web applications.\nStrong understanding of HTTP fundamentals and REST API development.\nHands-on experience with AWS S3 for cloud storage solutions.\nStrong problem-solving skills and attention to detail.\nPreferred:\nExperience in ERP development, particularly HRMS or accounting systems.\nImmediate joiners, notice period of maximum 15 days.\nContract Duration:\n1-year contract\nSalary:\n₹20,000 - ₹25,000/- per month in hand\nNumber of Open Positions:\n2\nBenefits:\nRemote work opportunity with flexibility to join from anywhere in India.\n5 days work week from Monday to Friday.\nExposure to diverse, cutting-edge projects in web, ERP, and API development.\nCollaborative and supportive team environment.\nJob Types: Full-time, Contractual / Temporary\nContract length: 12 months\nPay: ₹20,000.00 - ₹25,000.00 per month\nBenefits:\nWork from home\nLocation Type:\nRemote\nSchedule:\nMonday to Friday\nMorning shift\nApplication Question(s):\nDo you have have experience in backend development using Go, Gin framework, HTTP and REST API development? This is mandatory.\nAre you comfortable with the salary range of 20k to 25k in hand per month?\nWork Location: Remote", "source": "Indeed"}
{"company_name": "Nielsen", "job_title": "FrontEnd Developer - ReactJS MTS 2", "job_location": "Bengaluru, Karnataka", "apply_link": "https://in.indeed.com/viewjob?jk=abecc3984ffa72fc", "job_description": "At Nielsen, we are passionate about our work to power a better media future for all people by providing powerful insights that drive client decisions and deliver extraordinary results. Our talented, global workforce is dedicated to capturing audience engagement with content - wherever and whenever it’s consumed. Together, we are proudly rooted in our deep legacy as we stand at the forefront of the media revolution. When you join Nielsen, you will join a dynamic team committed to excellence, perseverance, and the ambition to make an impact together. We champion you, because when you succeed, we do too. We enable your best to power our future.\nThis role will be part of a team that develops software interfaces with all the major TV streaming providers, and downloads tens of thousands of movies and TV shows from US and international platforms.\nThe Software Engineer is ultimately responsible for delivering technical solutions: starting from the project's onboard until post launch support and including development, testing and user acceptance.\nResponsibilities\nSystem Deployment:\nBuild new features in the existing video and meta-data asset capture systems.\nCI/CD Implementation:\nLeverage CI/CD pipelines for automated build, test, and deployment processes.\nEnsure continuous integration and delivery of features, improvements, and bug fixes.\nCode Quality and Best Practices:\nAdhere to coding standards, best practices, and design principles.\nParticipate in code reviews and provide constructive feedback to maintain high code quality.\nPerformance Optimization:\nAssist in the Identification of performance bottlenecks in both client-side and data upload components.\nOptimize applications for remote/unassisted installation.\nTeam Collaboration:\nFollow best practices.\nCollaborate with cross-functional teams to ensure a cohesive and unified approach to software development.\nSecurity and Compliance:\nImplement security best practices for both client and upload components.\nAdhere to industry standards and regulations related to web application security.\nKey Skills\nBachelor's or Master’s degree in Computer Science, Software Engineering, or a related field.\nProven experience, minimum 2 years, in Client-side development expertise using ReactJs\nGood understanding of CI/CD principles and tools.\nGood problem-solving and debugging skills.\nGood communication and collaboration skills with ability to communicate technical concepts\nUtilizes team collaboration to contribute to innovative solutions efficiently\nOther good to have skills\nExposure to the AWS tech stack.\nExperience with Golang or Python.\nPlease be aware that job-seekers may be at risk of targeting by scammers seeking personal data or money. Nielsen recruiters will only contact you through official job boards, LinkedIn, or email with a nielsen.com domain. Be cautious of any outreach claiming to be from Nielsen via other messaging platforms or personal email addresses. Always verify that email communications come from an @nielsen.com address. If you're unsure about the authenticity of a job offer or communication, please contact Nielsen directly through our official website or verified social media channels.", "source": "Indeed"}
{"company_name": "Kofuku Technologies Pvt. Ltd.", "job_title": "DevOps Engineer", "job_location": "New Town, Kolkata, West Bengal", "apply_link": "https://in.indeed.com/viewjob?jk=60a8d76c4a6137eb", "job_description": "About the Role:\nWe are seeking a skilled and motivated\nDevOps Engineer\nwith 3 to 5 years of hands-on experience to join our growing technology team.\nYou will be responsible for supporting the development lifecycle by automating\ninfrastructure, enhancing CI/CD pipelines, monitoring systems, and ensuring\nscalable, secure, and resilient deployments.\nKey Responsibilities:\nDesign,implement and maintain scalable and secure CI/CD pipelines.\nAutomate infrastructure provisioning using tools like Terraform, Ansible, or\nCloudFormation.\nManage and monitor cloud environments (\nAWS preffered\n, Azure, or GCP).\nSet up and maintain container orchestration platforms (Docker, Kubernetes,ECS, etc.).\nCollaborate with development teams to ensure smooth code releases and operational stability.\nImprove system reliability and performance through observability, logging, and alerting tools.\nTroubleshoot production issues and participate in incident response.\nEnforce security best practices and compliance requirements.\nRequired Skills and Qualifications:\n3-5 years of professional experience in a DevOps or Infrastructure role.\nProficient in scripting languages (e.g., Bash, Python, or Shell).\nHands-on experience with CI/CD tools (Jenkins, GitLab CI, CircleCI, etc.).\nStrong experience with cloud platforms (preferably AWS, but Azure/GCP is\nacceptable).\nSolid knowledge of containerization and orchestration (Docker, Kubernetes,Helm)\nFamiliar with infrastructure as code (Terraform, Ansible, or similar).\nExperience with monitoring and logging tools (Prometheus, Grafana, ELK stack, etc.).\nGood understanding of networking, security, and system administration fundamentals.\nPreferred Qualifications:\nExperience working in Agile/Scrum environments.\nFamiliarity with version control systems like Git and GitOps practices.\nCertification in cloud platforms (AWS Certified DevOps Engineer, etc.) is a plus.\nExperience with service mesh, secrets management, and performance tuning is advantageous.\nJob Type: Full-time\nPay: ₹65,000.00 - ₹70,000.00 per month\nSchedule:\nFixed shift\nApplication Question(s):\nAre you comfortable with the salary?\nHow many years of Version Controlling experience do you have?\nHow many years of Containerization and Orchestration experience do you have?\nHow many years of CI/CD Pipeline experience do you have?\nHow many years of Automation Scripting experience do you have?\nDo you have experience with monitoring tools?\nHow many years of Automate Infrastructure Tool Experience do you have?\nExperience:\nDevOps: 3 years (Required)\nLicense/Certification:\nAWS Certification (Required)\nWork Location: In person", "source": "Indeed"}
{"company_name": "Blownfuse Softlabs India Private limited", "job_title": "Unity Game Developer", "job_location": "Behala, Kolkata, West Bengal", "apply_link": "https://in.indeed.com/viewjob?jk=5b16cae5e3c74956", "job_description": "We are a funded startup looking for a talented\nUnity Developer\nto join our team in Kolkata. The ideal candidate should have hands-on experience in Unity 3D development, C# programming, and game mechanics. You will be responsible for developing, optimizing, and maintaining high-quality interactive applications and games for multiple platforms.\nResponsibilities:\nDevelop and implement game mechanics, UI, and features using Unity and C#.\nOptimize code and assets for performance across different devices.\nDebug and troubleshoot issues to ensure smooth gameplay experience.\nCollaborate with designers, artists, and other developers to create engaging experiences.\nIntegrate third-party SDKs, APIs, and plugins as needed.\nStay updated with the latest Unity features, tools, and best practices.\nRequirements:\n1-3 years of experience\nin Unity game development.\nProficiency in\nC# programming\nand object-oriented principles.\nStrong understanding of\ngame physics, animations, UI/UX, and 3D environments\n.\nExperience in\nAR/VR, multiplayer networking (Photon, Mirror), or mobile game development\nis a plus.\nKnowledge of\nUnity Asset Store, shaders, and optimization techniques\n.\nFamiliarity with\nversion control tools (Git, SVN)\n.\nAbility to work in a team environment and meet deadlines.\nPreferred Qualifications:\nBachelor’s degree in\nComputer Science, Game Development, or a related field\n.\nA gamer at heart.\nExperience in\niOS/Android deployment\nand knowledge of platform-specific requirements.\nPassion for gaming and interactive applications.\nSalary: Competitive and based on experience\nJob Types: Full-time, Permanent\nPay: ₹12,083.45 - ₹30,000.00 per month\nBenefits:\nFlexible schedule\nHealth insurance\nSchedule:\nDay shift\nSupplemental Pay:\nPerformance bonus\nYearly bonus\nAbility to commute/relocate:\nBehala, Kolkata, West Bengal: Reliably commute or planning to relocate before starting work (Preferred)\nApplication Question(s):\nShare some of the work/portfolio links that you have worked on.\nWhat is your favourite game and what do you like about it?\nExperience:\nUnity: 1 year (Preferred)\nWork Location: In person\nExpected Start Date: 01/06/2025", "source": "Indeed"}
{"company_name": "LILO", "job_title": "Data Science Intern", "job_location": "Thiruvananthapuram, Kerala", "apply_link": "https://in.indeed.com/viewjob?jk=1bb913cda2687038", "job_description": "Job Title:\nData Science Intern\nLocation:\nTrivandrum\nWe are looking for a motivated\nData Science Intern\nto join our team and gain hands-on experience working with real-world datasets and advanced analytics techniques.\nKey Responsibilities:\n✓ Assist in analyzing large datasets using tools like Python (Pandas, NumPy) and R to identify trends, patterns, and actionable insights.\n✓ Develop, test, and implement machine learning and deep learning models using frameworks such as scikit-learn, TensorFlow, or Keras to support business decisions.\n✓ Collaborate with cross-functional teams including Marketing, IT, and Operations to understand data requirements and deliver insights.\n✓ Create dashboards and visualizations using tools like Tableau, Power BI, or Python libraries (Matplotlib, Seaborn) to effectively communicate findings.\n✓ Perform data cleaning, preprocessing, and validation to ensure accuracy using SQL and scripting languages.\n✓ Stay updated on emerging tools, technologies, and trends in data science and deep learning.\nPreferred Qualifications:\n✓ Currently pursuing or recently completed a degree in Data Science, Computer Science, Statistics, or related fields.\n✓ Strong foundation in statistics,\nmachine learning, deep learning, and data modeling.\n✓ Proficient in\nPython or R programming\n.\n✓ Experience with data visualization tools: Tableau,\nPower BI\n, Matplotlib, Seaborn.\n✓ Familiarity with\nSQL\nand database management.\n✓ Knowledge of cloud platforms such as\nAWS, Azure, or Google Cloud\nis a plus.\n✓ Strong problem-solving skills and attention to detail.\nWhat We Offer:\n✓ Hands-on experience with real-world datasets and projects.\n✓ Mentorship from experienced data science professionals.\n✓ Potential opportunity for full-time employment based on performance.\nExperience:\nFreshers are welcome\nDuration:\n3 months\nIf you’re interested,\napply now!\nJob Types: Full-time, Fresher, Internship\nPay: From ₹8,000.00 per month\nBenefits:\nFlexible schedule\nProvident Fund\nEducation:\nBachelor's (Preferred)\nWork Location: In person", "source": "Indeed"}
{"company_name": "Autosprint", "job_title": "1. Junior AI Engineer", "job_location": "Chanda Nagar, Hyderabad, Telangana", "apply_link": "https://in.indeed.com/viewjob?jk=9ac686a4ea9cfd85", "job_description": "We are hiring a Junior AI Engineer to assist in developing and deploying AI-driven\nsolutions. The ideal candidate should have a strong foundation in AI/ML techniques\nand be eager to work on real-world projects.\nResponsibilities:\n Develop and implement AI models for various applications.\n Support data collection, cleaning, and preprocessing activities.\n Conduct experiments to improve existing AI algorithms.\n Work with cross-functional teams to integrate AI solutions into products.\n Stay updated on the latest AI trends and advancements.\nRequirements:\n Bachelor's degree in Computer Science, AI, Data Science, or a related field.\n Proficiency in Python and familiarity with AI libraries (TensorFlow, PyTorch,\nOpenCV).\n Basic understanding of neural networks, NLP, or computer vision.\n Ability to write clean, efficient, and well-documented code.\n Strong problem-solving and critical-thinking skills.\nJob Types: Full-time, Fresher\nPay: ₹600,000.00 - ₹800,000.00 per year\nWork Location: In person", "source": "Indeed"}
{"company_name": "NATIVE CAPITAL", "job_title": "Equity Research Analyst", "job_location": "Marine Drive, Mumbai, Maharashtra", "apply_link": "https://in.indeed.com/viewjob?jk=25dc5be0e90d3f6e", "job_description": "Hiring for Equity Research Analyst\nJob description:\n· Sector-wise industry analysis including financial ratios, growth outlook, regulatory/ govt impact, valuation multiples\n· Bottom-up research on target companies – based on annual reports, quarterly financials, review of various investor resources like concalls, public domain searches\n· On-ground research – management meetings, plant visits, dealer / store visits, industry sources\n· Financial excel modelling with basic valuation & return analysis\n· Writing brief research notes with investment recommendations\n· Daily tracking of news/ corporate announcements and Quarterly tracking of results\n· Other office/ admin/ compliance work\nWhat we are looking for\n: Someone who has:\n1. 2 year work experience in the field of equity research\n2. Keen interest & passion in investing & equity markets\n3. Decent ability for fundamental research and understanding of financial statements, ratios, valuations\n4. Basic operational knowledge of MS Excel functions and data analysis and ability to use softwares like Screener, ACE Equity, etc.\nAbout the role:\n· Research Analyst Role – Full Time\n· Mon - Fri: 9am-7pm; Saturday half day.\n· Location: Work from office - located at Marine Drive, Mumbai\n· Salary: 40,000 – 50,000 per month – based on profile & interview\nAbout Native Capital:\nNative Capital is an investment firm focussed on investments in micro, small & midcap listed companies. We are in the process of applying for a Portfolio Management Service (PMS) license with SEBI.\nOur Investment approach is bottom-up fundamental research of undiscovered/ out of favour companies, where there is a margin of safety. We are based in Mumbai.\nNaysar Parikh is the Founder & Managing Partner of Native Capital. Prior to starting this firm in Jan, 2022, he was the Vice President at The Carlyle Group (a US-listed global Private Equity firm with over $350bn AUM). At Carlyle he worked for 5 years in the India investment team and led several growth & buyout investments across various sectors - including marquee deals like Piramal Pharma, SBI Cards, SBI Life Insurance, PNB Housing Finance, Delhivery Logistics, Metropolis Healthcare. Prior to that, he was a management consultant with Boston Consulting Group (BCG). By education, he is a rank-holder Chartered Accountant.\nJob Type: Full-time\nPay: ₹500,000.00 - ₹700,000.00 per year\nApplication Question(s):\nHave you completed your CA or CFA course?\nExperience:\ntotal work: 2 years (Required)\nWork Location: In person\nApplication Deadline: 25/05/2024\nExpected Start Date: 01/07/2025", "source": "Indeed"}
